{
  "education": [
    {
      "awards_achievements": [
        "Granted enrollment in the Biomedical Program due to highly competitive first year grades.",
        "GPA: 3.3/4.0"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Electrical and Biomedical Engineering",
      "duration": "2016-2021",
      "school_name": "McMaster University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HussainFathi",
  "highlighted_projects": [
    {
      "description": "Designed and built a smart video capturing device that follows a target throughout a training session or a game in order to provide real time athletic performance analysis. The project was awarded the best electronic hardware device by the Electrical and Computer Engineering (ECE) Department.",
      "git_url": null,
      "name": "Athletic Tracking Assistant | Final Year Capstone Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed, developed, and tested a Linux cluster usage administration agent that allows the user to analyze the usage data of different Linux machines connected together through a network switch. A PSQL docker container was employed in this project to store the machine's usage and hardware data that are obtained by executing two different bash scripts. Crontab was used to automate the data acquisition and the database insertion process of the usage data. Finally, multiple SQL queries can be executed to analyze the data.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "**Grep App**: Developed a Java application that searches through all the files in a given directory and outputs a text file containing all the lines matching a given regex pattern. The project employed Maven as the project management tool as well as Java Stream APIs for efficient memory usage. The app is available on DockerHub and can be deployed using Docker.",
        "**JDBC App**: In Progress",
        "**Twitter App**: Not Started!"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Hussain Fathi",
  "others": [
    {
      "bullets": [
        "Best electronic hardware device awarded by the Electrical and Computer Engineering Department (ECE) at McMaster University for the final year capstone project."
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Volunteer, VP Media @ McMaster Planetary Society (2019-2020): Worked in a team of 7 other executive members to promote, plan and host space related events to McMaster University students."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Took part in an Agile work environment as a data engineer and lead various sprint meetings. Implemented multiple software related projects employing a wide range of technologies such as Java, SQL, Docker, Git and Bash.",
      "duration": "2021-present",
      "title": "Data Engineer"
    },
    {
      "company": "LatAm Startups",
      "description": "Participated in internal and customer-driven design reviews to discuss the functionalities that need to be incorporated into the platform. Employed MEAN stack technologies to develop an enterprise platform from client to server to database.",
      "duration": "2021-present",
      "title": "Software Engineer"
    },
    {
      "company": "Department of National Defence",
      "description": "Worked in the Radar Electronic Warfare (REW) team within the Defense Research and Development Canada agency (DRDC) which is aimed to provide the Canadian Armed Forces with modern radar detection technology. Employed advanced signal processing techniques and machine learning tools such as neural networks, random forest, and Support Vector Machines (SVM) to classify different categories of cognitive radars.",
      "duration": "2020",
      "title": "Software Engineer Intern"
    },
    {
      "company": "Adlib Software",
      "description": "Worked in an interdisciplinary Agile team environment and interacted with Business Analysts, Product Owners, and other stakeholders regularly to discuss new product requirements and specifications. Took part in back-end development and front-end web development to implement new functionalities to the enterprise software.",
      "duration": "2019",
      "title": "Software Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Keras",
      "NumPy",
      "Scikit-learn",
      "Docker"
    ],
    "familiar": [
      "Google Cloud Platform",
      ".NET framework",
      "React",
      "Express.js",
      "Angular"
    ],
    "proficient": [
      "Java",
      "Node.js",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent Electrical and Biomedical Engineering graduate from McMaster University. I'm currently working as a Data Engineer at Jarvis Consulting, taking part in multiple projects such as the Linux Cluster Usage Administration, Java Grep and Java Twitter apps. In addition to Jarvis, I'm also currently working as a Software Engineer at a startup company based in Toronto. My role is centered around designing, developing, and testing an enterprise-level platform targeted towards helping international startup companies to enter the North American markets. Throughout my undergraduate career, I have completed 16 months worth of internship experiences in the fields of Machine Learning and Software development at the Department of National Defence in Ottawa and Adlib Software. I'm really passionate about computer science because it introduces a way of thinking that can be used to address specific problems we're facing in our daily lives."
}
